# PANDAS LIBRARY

In [1]:
#Pandas is a Python library.
#Pandas is used to analyze data.

In [2]:
#What is Pandas?
#Pandas is a Python library used for working with data sets.
#It has functions for analyzing, cleaning, exploring, and manipulating data.

In [3]:
#Why Use Pandas?
#Pandas allows us to analyze big data and make conclusions based on statistical theories.
#Pandas can clean messy data sets, and make them readable and relevant.
#Relevant data is very important in data science

In [4]:
#What Can Pandas Do?
#Pandas gives you answers about the data. Like:
#Is there a correlation between two or more columns?
#What is average value?
#Max value?
#Min value?
#Pandas are also able to delete rows that are not relevant, or contains wrong values,
#like empty or NULL values. This is called cleaning the data.

In [5]:
#import pandas
import pandas as pd
data = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}
v = pd.DataFrame(data)
print(v)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [6]:
#Checking Pandas Version
import pandas as pd
print(pd.__version__)

1.4.2

# Pandas Series
What is a Series?
1.A Pandas Series is like a column in a table.
2.It is a one-dimensional array holding data of any type

In [7]:
#Create a simple Pandas Series from a list:

import pandas as pd
a = [1, 7, 2]
v = pd.Series(a)
print(v)

0    1
1    7
2    2
dtype: int64

In [8]:
print(v[0])

1

In [9]:
#create lables as index
import pandas as pd
a = [1, 7, 2]
v= pd.Series(a, index = ["x", "y", "z"])
print(v)

x    1
y    7
z    2
dtype: int64

In [10]:
print(v["y"])

7

In [11]:
v.sort_index()

x    1
y    7
z    2
dtype: int64

In [12]:
import pandas as pd
calories = {"day1": 420, "day2": 380, "day3": 390}      #by using dictionary 
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [13]:
#Create a Series using only data from "day1" and "day2":
import pandas as pd
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories, index = ["day1", "day2"])
print(myvar)

day1    420
day2    380
dtype: int64

# series operations

In [14]:
import pandas as pd 
import numpy as np

In [15]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [16]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [17]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [18]:
s=pd.Series([1,2,3,4],
            index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [19]:
s["a"]

1

In [20]:
s2=s.reindex(["b","d","a","c","e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [21]:
s3=pd.Series(["blue","yellow","purple"],
             index=[0,2,4])
s3

0      blue
2    yellow
4    purple
dtype: object

In [22]:
s3.reindex(range(6),method="ffill")

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [23]:
s4=s3.drop(2);s4

0      blue
4    purple
dtype: object

In [24]:
s=pd.Series(["b","b","b","b","c",
             "c","a","a","a"])
s

0    b
1    b
2    b
3    b
4    c
5    c
6    a
7    a
8    a
dtype: object

In [25]:
s.unique()

array(['b', 'c', 'a'], dtype=object)

In [26]:
s.value_counts()

b    4
a    3
c    2
dtype: int64

In [27]:
x=s.isin(["b","c"])
x

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
8    False
dtype: bool

In [28]:
s[x]

0    b
1    b
2    b
3    b
4    c
5    c
dtype: object

# DataFrames
1.Data sets in Pandas are usually multi-dimensional tables, called DataFrames.
2.Series is like a column, a DataFrame is the whole table.

In [29]:
#Create a DataFrame from two Series:
import pandas as pd
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
v = pd.DataFrame(data)
print(v)

   calories  duration
0       420        50
1       380        40
2       390        45

# What is a DataFrame?
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns

In [30]:
#Create a simple Pandas DataFrame:
import pandas as pd
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
#load data into a DataFrame object:
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [31]:
print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [32]:
#use a list of indexes:
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40

In [33]:
#Add a list of names to give each row a name:
df = pd.DataFrame(data, index = ["day1", "day2", "day3"])
print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [34]:
print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

In [35]:
df.sum()

calories    1190
duration     135
dtype: int64

In [36]:
df.sum(axis=1)

day1    470
day2    420
day3    435
dtype: int64

In [37]:
df.mean()

calories    396.666667
duration     45.000000
dtype: float64

In [38]:
df.max()

calories    420
duration     50
dtype: int64

In [39]:
df.idxmax()

calories    day1
duration    day1
dtype: object

In [40]:
df.idxmin()

calories    day2
duration    day2
dtype: object

In [41]:
df.cumsum()

      calories  duration
day1       420        50
day2       800        90
day3      1190       135

In [42]:
df.describe()

         calories  duration
count    3.000000       3.0
mean   396.666667      45.0
std     20.816660       5.0
min    380.000000      40.0
25%    385.000000      42.5
50%    390.000000      45.0
75%    405.000000      47.5
max    420.000000      50.0

# dataframe operations

In [43]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Tim","Tom"])

df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Tim","Kate","Tom"])

print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [44]:
df1+df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [45]:
df1-df2

        A   B    C   D
Kate  NaN NaN  NaN NaN
Tim   0.0 NaN  1.0 NaN
Tom  -3.0 NaN -2.0 NaN

In [46]:
df1.add(df2,fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [47]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [48]:
print(df1*3);
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

     A   B   C
Tim  0   3   6
Tom  9  12  15

# Applying a Function

In [49]:
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"])
df

              A         B         C
Kim   -0.463750 -0.854242  0.457403
Susan  1.641370  0.003912  0.915014
Tim    1.180901  0.281717 -0.379404
Tom    0.983942  1.720493 -0.809010

In [50]:
np.abs(df)

              A         B         C
Kim    0.463750  0.854242  0.457403
Susan  1.641370  0.003912  0.915014
Tim    1.180901  0.281717  0.379404
Tom    0.983942  1.720493  0.809010

In [51]:
df

              A         B         C
Kim   -0.463750 -0.854242  0.457403
Susan  1.641370  0.003912  0.915014
Tim    1.180901  0.281717 -0.379404
Tom    0.983942  1.720493 -0.809010

In [52]:
f=lambda x:x.max()-x.min()
df.apply(f)

A    2.105121
B    2.574735
C    1.724024
dtype: float64

In [53]:
df.apply(f,axis=1)

Kim      1.311646
Susan    1.637459
Tim      1.560304
Tom      2.529503
dtype: float64

In [54]:
def f(x):
    return x**2

In [55]:
df.apply(f)

              A         B         C
Kim    0.215064  0.729730  0.209218
Susan  2.694097  0.000015  0.837250
Tim    1.394526  0.079364  0.143947
Tom    0.968142  2.960097  0.654497

In [56]:
#Load a Python Dictionary into a DataFrame:

import pandas as pd

data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

df = pd.DataFrame(data)

print(df)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

# Pandas - Analyzing DataFrames  (lung_cap realworld data)

In [57]:
data=pd.read_excel(r"E:\\dataset/LungCap.xls")

In [58]:
data

     LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0          6.475            6            62.1    no    male        no
1         10.125           18            74.7   yes  female        no
2          9.550           16            69.7    no  female       yes
3         11.125           14            71.0    no    male        no
4          4.800            5            56.9    no    male        no
..           ...          ...             ...   ...     ...       ...
720        5.725            9            56.0    no  female        no
721        9.050           18            72.0   yes    male       yes
722        3.850           11            60.5   yes  female        no
723        9.825           15            64.9    no  female        no
724        7.100           10            67.7    no    male        no

[725 rows x 6 columns]

In [59]:
data.head(5)

   LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0        6.475            6            62.1    no    male        no
1       10.125           18            74.7   yes  female        no
2        9.550           16            69.7    no  female       yes
3       11.125           14            71.0    no    male        no
4        4.800            5            56.9    no    male        no

In [60]:
data.tail(5)

     LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
720        5.725            9            56.0    no  female        no
721        9.050           18            72.0   yes    male       yes
722        3.850           11            60.5   yes  female        no
723        9.825           15            64.9    no  female        no
724        7.100           10            67.7    no    male        no

In [61]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 725 entries, 0 to 724
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   LungCap(cc)     725 non-null    float64
 1   Age( years)     725 non-null    int64
 2   Height(inches)  725 non-null    float64
 3   Smoke           725 non-null    object
 4   Gender          725 non-null    object
 5   Caesarean       725 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 34.1+ KB

In [62]:
data.columns

Index(['LungCap(cc)', 'Age( years)', 'Height(inches)', 'Smoke', 'Gender',
       'Caesarean'],
      dtype='object')

In [63]:
data.dtypes

LungCap(cc)       float64
Age( years)         int64
Height(inches)    float64
Smoke              object
Gender             object
Caesarean          object
dtype: object

In [64]:
data.Caesarean.value_counts()

no     561
yes    164
Name: Caesarean, dtype: int64

In [65]:
data.describe()

       LungCap(cc)  Age( years)  Height(inches)
count   725.000000   725.000000      725.000000
mean      7.863148    12.326897       64.836276
std       2.662008     4.004750        7.202144
min       0.507000     3.000000       45.300000
25%       6.150000     9.000000       59.900000
50%       8.000000    13.000000       65.400000
75%       9.800000    15.000000       70.300000
max      14.675000    19.000000       81.800000

In [66]:
data.Caesarean.value_counts()

no     561
yes    164
Name: Caesarean, dtype: int64

# data selection

# loc   DataFrame

df.loc[row_indexer,column_indexer]

In [67]:
data

     LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0          6.475            6            62.1    no    male        no
1         10.125           18            74.7   yes  female        no
2          9.550           16            69.7    no  female       yes
3         11.125           14            71.0    no    male        no
4          4.800            5            56.9    no    male        no
..           ...          ...             ...   ...     ...       ...
720        5.725            9            56.0    no  female        no
721        9.050           18            72.0   yes    male       yes
722        3.850           11            60.5   yes  female        no
723        9.825           15            64.9    no  female        no
724        7.100           10            67.7    no    male        no

[725 rows x 6 columns]

In [68]:
data.loc[0,:]

LungCap(cc)       6.475
Age( years)           6
Height(inches)     62.1
Smoke                no
Gender             male
Caesarean            no
Name: 0, dtype: object

In [69]:
data.loc[[0,1,2],:]

   LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0        6.475            6            62.1    no    male        no
1       10.125           18            74.7   yes  female        no
2        9.550           16            69.7    no  female       yes

In [70]:
data.loc[0:2,:]

   LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0        6.475            6            62.1    no    male        no
1       10.125           18            74.7   yes  female        no
2        9.550           16            69.7    no  female       yes

In [71]:
data.loc[:,"LungCap(cc)"]

0       6.475
1      10.125
2       9.550
3      11.125
4       4.800
        ...
720     5.725
721     9.050
722     3.850
723     9.825
724     7.100
Name: LungCap(cc), Length: 725, dtype: float64

In [72]:
data.loc[:,['LungCap(cc)','Caesarean']]

     LungCap(cc) Caesarean
0          6.475        no
1         10.125        no
2          9.550       yes
3         11.125        no
4          4.800        no
..           ...       ...
720        5.725        no
721        9.050       yes
722        3.850        no
723        9.825        no
724        7.100        no

[725 rows x 2 columns]

In [73]:
data.loc[:,'LungCap(cc)':'Caesarean']

     LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0          6.475            6            62.1    no    male        no
1         10.125           18            74.7   yes  female        no
2          9.550           16            69.7    no  female       yes
3         11.125           14            71.0    no    male        no
4          4.800            5            56.9    no    male        no
..           ...          ...             ...   ...     ...       ...
720        5.725            9            56.0    no  female        no
721        9.050           18            72.0   yes    male       yes
722        3.850           11            60.5   yes  female        no
723        9.825           15            64.9    no  female        no
724        7.100           10            67.7    no    male        no

[725 rows x 6 columns]

In [74]:
data.loc[data.Gender=="male"]

     LungCap(cc)  Age( years)  Height(inches) Smoke Gender Caesarean
0          6.475            6            62.1    no   male        no
3         11.125           14            71.0    no   male        no
4          4.800            5            56.9    no   male        no
6          4.950            8            63.3    no   male       yes
7          7.325           11            70.4    no   male        no
..           ...          ...             ...   ...    ...       ...
716        7.075           11            66.7    no   male       yes
718        7.175           17            68.8    no   male       yes
719        7.325            9            66.3    no   male        no
721        9.050           18            72.0   yes   male       yes
724        7.100           10            67.7    no   male        no

[367 rows x 6 columns]

# iloc

In [75]:
data.columns

Index(['LungCap(cc)', 'Age( years)', 'Height(inches)', 'Smoke', 'Gender',
       'Caesarean'],
      dtype='object')

In [76]:
data.iloc[:,0:2]

     LungCap(cc)  Age( years)
0          6.475            6
1         10.125           18
2          9.550           16
3         11.125           14
4          4.800            5
..           ...          ...
720        5.725            9
721        9.050           18
722        3.850           11
723        9.825           15
724        7.100           10

[725 rows x 2 columns]

In [77]:
data.loc[0:2,:]

   LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0        6.475            6            62.1    no    male        no
1       10.125           18            74.7   yes  female        no
2        9.550           16            69.7    no  female       yes

In [78]:
data.iloc[0:2,:]             #iloc excludes last number

   LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0        6.475            6            62.1    no    male        no
1       10.125           18            74.7   yes  female        no

In [79]:
data[0:2]

   LungCap(cc)  Age( years)  Height(inches) Smoke  Gender Caesarean
0        6.475            6            62.1    no    male        no
1       10.125           18            74.7   yes  female        no

# conditons in pandas

In [131]:
import pandas as pd
 
# Sample DataFrame
data = {'Numbers': [1, 5, 8, 3, 6, 9]}
df = pd.DataFrame(data)
 
# Applying an if condition using where method
threshold = 5
df['Conditioned_Numbers'] = df['Numbers'].where(df['Numbers'] > threshold, other='Below Threshold')
 
# Display the DataFrame
print(df)

   Numbers Conditioned_Numbers
0        1     Below Threshold
1        5     Below Threshold
2        8                   8
3        3     Below Threshold
4        6                   6
5        9                   9

In [132]:
from pandas import DataFrame
 
numbers = {'mynumbers': [51, 52, 53, 54, 55]}
df = DataFrame(numbers, columns =['mynumbers'])
 
df.loc[df['mynumbers'] <= 53, '<= 53'] = 'True'
df.loc[df['mynumbers'] > 53, '<= 53'] = 'False'
 
df

   mynumbers  <= 53
0         51   True
1         52   True
2         53   True
3         54  False
4         55  False

In [133]:
from pandas import DataFrame
 
names = {'First_name': ['Hanah', 'Ria', 'Jay', 'Bholu', 'Sachin']}
df = DataFrame(names, columns =['First_name'])
 
df.loc[df['First_name'] == 'Ria', 'Status'] = 'Found' 
df.loc[df['First_name'] != 'Ria', 'Status'] = 'Not Found'
 
print (df)

  First_name     Status
0      Hanah  Not Found
1        Ria      Found
2        Jay  Not Found
3      Bholu  Not Found
4     Sachin  Not Found

In [134]:
from pandas import DataFrame
 
numbers = {'mynumbers': [51, 52, 53, 54, 55]}
df = DataFrame(numbers, columns =['mynumbers'])
 
df['<= 53'] = df['mynumbers'].apply(lambda x: 'True' if x <= 53 else 'False')
 
print (df)

   mynumbers  <= 53
0         51   True
1         52   True
2         53   True
3         54  False
4         55  False

# missing values treatment

In [1]:
import pandas as pd

df = pd.read_csv('E:\dataset/Credit_Risk_data.csv')
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [2]:
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [ ]:
#To deal with missing values
#for categorical columns 
method : 1) drop 
         2) fill with lowest count
#for mumerical column 
         1)drop
         2) fill with mean or median

In [3]:
#gender is categorical column(12 NA) 
df.Gender.value_counts()                            # female has least count
                                                    #so fill na values with lower count that is female

Male      489
Female    112
Name: Gender, dtype: int64

In [4]:
df.Gender.fillna("Female",inplace=True)

In [84]:
df.Gender.value_counts()

Male      489
Female    125
Name: Gender, dtype: int64

In [85]:
df.Gender.isnull().sum()

0

In [109]:
#married is also categorical
df.Married.value_counts()

Yes    398
No     213
Name: Married, dtype: int64

In [87]:
df.Married.isnull().sum()

3

In [114]:
df.Married.fillna("No",inplace=True)

In [115]:
df.Married.isnull().sum()

0

In [116]:
df.Married.value_counts()

Yes    398
No     216
Name: Married, dtype: int64

In [117]:
#loanamount is numerical column

In [118]:
df.LoanAmount.value_counts()

120.0    20
110.0    17
100.0    15
160.0    12
187.0    12
         ..
240.0     1
214.0     1
59.0      1
166.0     1
253.0     1
Name: LoanAmount, Length: 203, dtype: int64

In [120]:
df.LoanAmount.isnull().sum()          #have 22 missing values

22

In [7]:
df.LoanAmount.skew()

2.677551679256059

In [129]:
# FILL WITH MEAN , median, mode
#df.LoanAmount.fillna(df["LoanAmount"].mean(), inplace=True)
#df.LoanAmount.fillna(df["LoanAmount"].median(), inplace=True)
df.LoanAmount.fillna(df["LoanAmount"].mode()[0], inplace=True)

In [130]:
df.LoanAmount.isnull().sum()

0

In [ ]:
df